//Найти квадрат числа
Console.Write("Введите число: ");
double num = Convert.ToDouble(Console.ReadLine());
double result = num * num;
Console.Write("Квадрат числа: ");
Console.WriteLine(result);
